snlkuharlocal/src/Enums/СтатусыКарточкиНоменклатурыВЧЗ/СтатусыКарточкиНоменклатурыВЧЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыКарточкиНоменклатурыВЧЗ</name>
  <enumValues>
    <name>НеПодлежитМаркировке</name>
  </enumValues>
  <enumValues>
    <name>КОтправкевНК</name>
  </enumValues>
  <enumValues>
    <name>НеСоздана</name>
  </enumValues>
  <enumValues>
    <name>Создана</name>
  </enumValues>
  <enumValues>
    <name>НаМодерации</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетПодписания</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>Опубликована</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СтатусыКарточкиНоменклатурыВЧЗ/ManagerModule.bsl
Функция СтатусЧЗ_Статус1С(СтатусЧЗ) Экспорт
	Результат = Перечисления.СтатусыКарточкиНоменклатурыВЧЗ.ПустаяСсылка();
	
	Если НРег(СтатусЧЗ) = "moderation" Тогда               
		Результат = Перечисления.СтатусыКарточкиНоменклатурыВЧЗ.НаМодерации;
	ИначеЕсли НРег(СтатусЧЗ) = "signed" Тогда                               
		Результат = Перечисления.СтатусыКарточкиНоменклатурыВЧЗ.ОжидаетПодписания;		
	ИначеЕсли НРег(СтатусЧЗ) = "published" Тогда                                        
		Результат = Перечисления.СтатусыКарточкиНоменклатурыВЧЗ.Опубликована;		
	КонецЕсли;	
		
	Возврат Результат;
КонецФункции //СтатусЧЗ_Статус1С(СтатусЧЗ) Экспорт
